--- a/10-java/src/rt.jar.src/java/util/concurrent/executor.ThreadPoolExecutor.md
+++ b/10-java/src/rt.jar.src/java/util/concurrent/executor.ThreadPoolExecutor.md
@@ -121,27 +125,6 @@ RejectedExecutionHandler <|-- DiscardOldestPolicy
-            will run the terminated() hook method
-* TERMINATED(3): terminated() has completed
-     
-```mermaid
-graph LR
-    RUNNING -- shutdown --> SHUTDOWN
-    RUNNING -- shutdownNow --> STOP
-    SHUTDOWN -- shutdownNow --> STOP
-    SHUTDOWN -- queueAndPoolEmpty --> TIDYING
-    STOP -- poolEmpty --> TIDYING
-    TIDYING -- terminated --> TERMINATED
-```
-
 ## execute()
 
@@ -175,4 +158,51 @@ sequenceDiagram
+    TIDYING -- terminated --> TERMINATED
+```
+
+```plantuml
+@startuml
+[*] -right-> RUNNING
+RUNNING -right-> SHUTDOWN: shutdown()
+
+RUNNING --> STOP: shutdownNow()
+SHUTDOWN -right-> STOP: shutdownNow()
+
+SHUTDOWN -right-> TIDYING: queue, pool empty
+STOP --> TIDYING: pool empty
+
+TIDYING --> TERMINATED: terminated()
+TERMINATED -right-> [*]
+
+@enduml
 ```
